index="customer-index" sourcetype="wineventlog" EventCode="7045" 

```There are normal path that system service always installed ```
```wineventlog_system  is a marco```
`wineventlog_system` EventCode=7045  Service_File_Name = "*.exe" NOT (Service_File_Name IN ("*:\\Windows\\*", "*:\\Program File*", "*:\\Programdata\\*", "*%systemroot%\\*")) 
| stats count min(_time) as firstTime max(_time) as lastTime by EventCode Service_File_Name Service_Name Service_Start_Type Service_Type dest user 
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| `windows_service_created_with_suspicious_service_path_filter`
